DhariwalUNet(
  (map_noise): PositionalEmbedding()
  (map_layer0): Linear()
  (map_layer1): Linear()
  (enc): ModuleDict(
    (32x32_conv): Conv2d()
    (32x32_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
      (n3block): N3Block(
        (embedcnn): Sequential(
          (0): Conv2d(64, 8, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        )
        (tempcnn): Sequential(
          (0): Conv2d(64, 1, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        )
        (n3aggregation): N3Aggregation2D(
          (aggregation): N3AggregationBase(
            (nnn): NeuralNearestNeighbors(
              (bn): BatchNorm1d(1, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            )
          )
        )
      )
    )
    (16x16_down): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (16x16_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
      (n3block): N3Block(
        (embedcnn): Sequential(
          (0): Conv2d(128, 8, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        )
        (tempcnn): Sequential(
          (0): Conv2d(128, 1, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        )
        (n3aggregation): N3Aggregation2D(
          (aggregation): N3AggregationBase(
            (nnn): NeuralNearestNeighbors(
              (bn): BatchNorm1d(1, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            )
          )
        )
      )
    )
    (8x8_down): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (4x4_down): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
    )
    (4x4_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
    )
  )
  (dec): ModuleDict(
    (4x4_in0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (4x4_in1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
    )
    (4x4_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block3): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_up): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block3): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_up): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (16x16_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block3): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_up): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block0): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_block1): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_block2): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_block3): UNetBlock(
      (norm0): GroupNorm()
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): GroupNorm()
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): GroupNorm()
      (qkv): Conv2d()
      (proj): Conv2d()
    )
  )
  (out_norm): GroupNorm()
  (out_conv): Conv2d()
)